Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
/******************************************************************************
*
* board.c - 1 sentence file description
* Copyright (c) notice
*
******************************************************************************/
#ifndef __BOARD_C__
#define __BOARD_C__
/******************************************************************************
* includes ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "utils_inc/error_codes.h"
#include "ThirdParty_inc/osal.h"
#include "utils_inc/util_debug.h"

#include "board.h"

//STM32F4 specific includes
//#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "core_cm4.h"


/******************************************************************************
* defines /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/
//camera defines
#define CAMERA_TIMER_INSTANCE  TIM4
#define CAMERA_I2C_INSTANCE    I2C2
#define I2C_ADDRESS            0x30F

//wifi defines
#define WIFI_TX_BUF_LEN  512
#define WIFI_RX_BUF_LEN  512

//flash defines
#define FLASH_USER_START_ADDR   ADDR_FLASH_SECTOR_11   /* Start @ of user Flash area */
#define FLASH_USER_END_ADDR     ADDR_FLASH_SECTOR_11 + 0x20000   /* End @ of user Flash area */

/* Base address of the Flash sectors */
#define ADDR_FLASH_SECTOR_0     ((uint32_t)0x08000000) /* Base @ of Sector 0, 16 Kbytes */
#define ADDR_FLASH_SECTOR_1     ((uint32_t)0x08004000) /* Base @ of Sector 1, 16 Kbytes */
#define ADDR_FLASH_SECTOR_2     ((uint32_t)0x08008000) /* Base @ of Sector 2, 16 Kbytes */
#define ADDR_FLASH_SECTOR_3     ((uint32_t)0x0800C000) /* Base @ of Sector 3, 16 Kbytes */
#define ADDR_FLASH_SECTOR_4     ((uint32_t)0x08010000) /* Base @ of Sector 4, 64 Kbytes */
#define ADDR_FLASH_SECTOR_5     ((uint32_t)0x08020000) /* Base @ of Sector 5, 128 Kbytes */
#define ADDR_FLASH_SECTOR_6     ((uint32_t)0x08040000) /* Base @ of Sector 6, 128 Kbytes */
#define ADDR_FLASH_SECTOR_7     ((uint32_t)0x08060000) /* Base @ of Sector 7, 128 Kbytes */
#define ADDR_FLASH_SECTOR_8     ((uint32_t)0x08080000) /* Base @ of Sector 8, 128 Kbytes */
#define ADDR_FLASH_SECTOR_9     ((uint32_t)0x080A0000) /* Base @ of Sector 9, 128 Kbytes */
#define ADDR_FLASH_SECTOR_10    ((uint32_t)0x080C0000) /* Base @ of Sector 10, 128 Kbytes */
#define ADDR_FLASH_SECTOR_11    ((uint32_t)0x080E0000) /* Base @ of Sector 11, 128 Kbytes */

/******************************************************************************
* variables ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

uint8_t uiWifi_TX_Buff[WIFI_TX_BUF_LEN];
uint8_t uiWifi_RX_Buff[WIFI_RX_BUF_LEN];

/******************************************************************************
* external variables //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* enums ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* structures //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

typedef struct tBSP_Activity_State
{
  bool bIs_Camera_Intf_Init;
  bool bIs_Wifi_Intf_Init;
  bool bIs_Usb_Intf_Init;
}tBSP_Activity_State;

tBSP_Activity_State tBSP_AS =
{
  false,  //bool bIs_Camera_Intf_Init;
  false,  //bool bIs_Wifi_Intf_Init;
  false,  //bool bIs_Usb_Intf_Init;
};

//USART_HandleTypeDef tWifi_UART_Handle;
UART_HandleTypeDef  tWifi_UART_Handle;
//TIM_HandleTypeDef   tCamera_Timer_Handle;
//I2C_HandleTypeDef   tCamera_I2C_Handle;

/******************************************************************************
* external functions //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

//extern void NVIC_PriorityGroupConfig(uint32_t NVIC_PriorityGroup);

/******************************************************************************
* private function declarations ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

ERROR_CODE eBSP_Camera_Intf_Init(void);
ERROR_CODE eBSP_Wifi_Intf_Init(void);
ERROR_CODE eBSP_Usb_Intf_Init(void);
ERROR_CODE eBSP_SystemClock_Config(void);

/******************************************************************************
* private functions ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: Filename_or_abreviation_funciton
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Camera_Intf_Init(void)
{
  ERROR_CODE eEC = ER_FAIL;
//  GPIO_InitTypeDef      tCamera_GPIO_Init;
//  uint32_t uwPrescalerValue;
//
//  if(tBSP_AS.bIs_Camera_Intf_Init == false)
//  {
//    //camera gpio init
//    //
//    //Config camera reset and power down pins to GPIO
//    __GPIOB_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin   = GPIO_PIN_4 | GPIO_PIN_5;
//    tCamera_GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
//    tCamera_GPIO_Init.Pull  = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed = GPIO_SPEED_HIGH;
//    HAL_GPIO_Init(GPIOB,&tCamera_GPIO_Init);
//
//    //config camera control interface pins to I2C
//    __GPIOB_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_10 | GPIO_PIN_11;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_AF_PP;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = GPIO_AF4_I2C2;
//    HAL_GPIO_Init(GPIOB,&tCamera_GPIO_Init);
//    __I2C2_CLK_ENABLE();
//
//    //I2C init
//    tCamera_I2C_Handle.Instance             = CAMERA_I2C_INSTANCE;
//    tCamera_I2C_Handle.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
//    tCamera_I2C_Handle.Init.ClockSpeed      = 400000;
//    tCamera_I2C_Handle.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
//    tCamera_I2C_Handle.Init.DutyCycle       = I2C_DUTYCYCLE_16_9;
//    tCamera_I2C_Handle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
//    tCamera_I2C_Handle.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;
//    tCamera_I2C_Handle.Init.OwnAddress1     = I2C_ADDRESS;
//    tCamera_I2C_Handle.Init.OwnAddress2     = 0;
//
//    if(HAL_I2C_Init(&tCamera_I2C_Handle) != HAL_OK)
//    {
//      /* Initialization Error */
//      eEC = ER_FAIL;
//    }
//
//    //config camera pixel(PCLK) and system (XCLK) pins to output timers
//    __GPIOD_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_14 | GPIO_PIN_15;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_AF_PP;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = GPIO_AF2_TIM4;
//    HAL_GPIO_Init(GPIOD,&tCamera_GPIO_Init);
//    __TIM4_CLK_ENABLE();
//
//    //Timer init
//    /* Compute the prescaler value to have TIM4 counter clock equal to 10 MHz */
//    uwPrescalerValue = (uint32_t) ((SystemCoreClock /2) / 10000000) - 1;
//
//    /* Set TIMx instance */
//    tCamera_Timer_Handle.Instance = CAMERA_TIMER_INSTANCE;
//
//    /* Initialize TIM4 peripheral as follow:
//         + Period = uwPrescalerValue/2
//         + Prescaler = ((SystemCoreClock/2)/10000000) - 1
//         + ClockDivision = 0
//         + Counter direction = Up
//    */
//    tCamera_Timer_Handle.Init.Period = uwPrescalerValue/2;
//    tCamera_Timer_Handle.Init.Prescaler = uwPrescalerValue;
//    tCamera_Timer_Handle.Init.ClockDivision = 0;
//    tCamera_Timer_Handle.Init.CounterMode = TIM_COUNTERMODE_UP;
//    if(HAL_TIM_Base_Init(&tCamera_Timer_Handle) != HAL_OK)
//    {
//      eEC = ER_FAIL;
//    }
//
//    HAL_TIM_Base_Start(&tCamera_Timer_Handle);
//
//    //config Digital Camera Interface pins
//    __GPIOC_CLK_ENABLE();
//                                  //DCMI 0, 1, 2, 3
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_INPUT;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = 0;
//    HAL_GPIO_Init(GPIOC, &tCamera_GPIO_Init);
//                                  //DCMI 4, 7
//    __GPIOE_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_4 | GPIO_PIN_7;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_INPUT;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = 0;
//    HAL_GPIO_Init(GPIOE, &tCamera_GPIO_Init);
//                                  //DCMI 5, 6
//    __GPIOB_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_6 | GPIO_PIN_8;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_INPUT;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = 0;
//    HAL_GPIO_Init(GPIOB, &tCamera_GPIO_Init);
//
//    //config HREF horizontal timing VSYNC vertical timing pins
//    __GPIOE_CLK_ENABLE();
//    tCamera_GPIO_Init.Pin       = GPIO_PIN_12 | GPIO_PIN_13;
//    tCamera_GPIO_Init.Mode      = GPIO_MODE_IT_RISING;
//    tCamera_GPIO_Init.Pull      = GPIO_NOPULL;
//    tCamera_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tCamera_GPIO_Init.Alternate = 0;
//    HAL_GPIO_Init(GPIOE, &tCamera_GPIO_Init);
//
//    HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0x0F, 0);
//    HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
//
//    eEC = ER_OK;
//
//    tBSP_AS.bIs_Camera_Intf_Init = true;
//  }
//  else
//  {
//    eEC = ER_OK;
//  }

  return eEC;
}

