Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: Filename_or_abreviation_funciton
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Wifi_Intf_Init(void)
{
  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_Status = HAL_ERROR;
  GPIO_InitTypeDef      tWifi_GPIO_Init;

  if(tBSP_AS.bIs_Wifi_Intf_Init == false)
  {
//    tWifi_GPIO_Init.Pin       = GPIO_PIN_10 | GPIO_PIN_9;
    tWifi_GPIO_Init.Pin       = GPIO_PIN_2 | GPIO_PIN_3;
    tWifi_GPIO_Init.Mode      = GPIO_MODE_AF_PP;//GPIO_MODE_AF_OD;//
    tWifi_GPIO_Init.Pull      = GPIO_NOPULL;//GPIO_PULLDOWN;//GPIO_PULLUP;//
    tWifi_GPIO_Init.Speed     = GPIO_SPEED_HIGH;
//    tWifi_GPIO_Init.Alternate = GPIO_AF7_USART1;
    tWifi_GPIO_Init.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA,&tWifi_GPIO_Init);

//    tWifi_UART_Handle.Init.BaudRate    = 115200;//57600;
//    tWifi_UART_Handle.Init.WordLength  = USART_WORDLENGTH_8B;
//    tWifi_UART_Handle.Init.StopBits    = USART_STOPBITS_1;
//    tWifi_UART_Handle.Init.Parity      = USART_PARITY_NONE;
//    tWifi_UART_Handle.Init.Mode        = USART_MODE_TX_RX;
//    tWifi_UART_Handle.Init.CLKPolarity = USART_POLARITY_LOW;//USART_POLARITY_HIGH;//
//    tWifi_UART_Handle.Init.CLKPhase    = USART_PHASE_1EDGE;//USART_PHASE_2EDGE;//
//    tWifi_UART_Handle.Init.CLKLastBit  = USART_LASTBIT_DISABLE;//USART_LASTBIT_ENABLE;//
//    tWifi_UART_Handle.Instance         = USART2;
//    eHAL_Status = HAL_USART_Init(&tWifi_UART_Handle);

    tWifi_UART_Handle.Init.BaudRate     = 115200;//57600;
    tWifi_UART_Handle.Init.WordLength   = UART_WORDLENGTH_8B;
    tWifi_UART_Handle.Init.StopBits     = UART_STOPBITS_1;
    tWifi_UART_Handle.Init.Parity       = UART_PARITY_NONE;
    tWifi_UART_Handle.Init.Mode         = UART_MODE_TX_RX;
    tWifi_UART_Handle.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    tWifi_UART_Handle.Init.OverSampling = UART_OVERSAMPLING_8;
    tWifi_UART_Handle.Instance          = USART2;
    eHAL_Status = HAL_UART_Init(&tWifi_UART_Handle);

    if(eHAL_Status == HAL_OK)
    {
      eEC = ER_OK;
      tBSP_AS.bIs_Wifi_Intf_Init = true;
    }
    else
    {
      eEC = ER_FAIL;
      tBSP_AS.bIs_Wifi_Intf_Init = false;
    }

    tWifi_GPIO_Init.Pin    = GPIO_PIN_0;
    tWifi_GPIO_Init.Mode   = GPIO_MODE_OUTPUT_PP;
    tWifi_GPIO_Init.Pull   = GPIO_NOPULL;
    tWifi_GPIO_Init.Speed  = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOA,&tWifi_GPIO_Init);

  }
  else
  {
    eEC = ER_OK;
  }
  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: Filename_or_abreviation_funciton
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Usb_Intf_Init(void)
{
  ERROR_CODE eEC = ER_FAIL;

  //The low level interface initialization is handled by the 3rd party driver
  if(tBSP_AS.bIs_Usb_Intf_Init == false)
  {
    tBSP_AS.bIs_Usb_Intf_Init = true;
  }

  eEC = ER_OK;

  return eEC;
}

/******************************************************************************
* todo: DESCRIPTION
* name: eBSP_SystemClock_Config
* description:
* param description: none
* return value description: ERROR_CODE - ER_OK: System clock configured
*                                      - ER_FAIL: System clock configuration process failed
******************************************************************************/
ERROR_CODE eBSP_SystemClock_Config(void)
{

  ERROR_CODE eEC = ER_FAIL;
  HAL_StatusTypeDef eHAL_STATUS = HAL_ERROR;

  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* The voltage scaling allows optimizing the power consumption when the device is
     clocked below the maximum system frequency, to update the voltage scaling value
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  eHAL_STATUS = HAL_RCC_OscConfig(&RCC_OscInitStruct);

  if(eHAL_STATUS == HAL_OK)
  {
  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
   clocks dividers */
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    eHAL_STATUS = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
  }

  if(eHAL_STATUS == HAL_OK)
  {
    /* STM32F405x/407x/415x/417x Revision Z devices: prefetch is supported  */
    if (HAL_GetREVID() == 0x1001)
    {
      /* Enable the Flash prefetch */
      __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
    }
  }

  if(eHAL_STATUS == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;

}

/******************************************************************************
* public functions ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
******************************************************************************/

