Hoxford/Tank_project/Src/platform/stm32f4disc/board.c
  //todo: disable interrupts

  /* Clear pending flags (if any) */
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);

  while(uiSectorIndex < uiEndSector)
  {
    uiData = 0;
    uiData |= (uint32_t)pParam->pBuff[3];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[2];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[1];
    uiData <<= 8;
    uiData |= (uint32_t)pParam->pBuff[0];
    eHAL_EC = HAL_FLASH_Program(TYPEPROGRAM_WORD, uiSectorIndex, uiData);
    if(eHAL_EC != HAL_OK)
    {
      break;
    }
    pParam->pBuff += 4;
    uiSectorIndex += 4;
  }
  //todo: enable interrupts
  vDEBUG_ASSERT("eBSP_FLASH_WRITE program fail", eHAL_EC == HAL_OK);

  eHAL_EC = HAL_FLASH_Lock();
  vDEBUG_ASSERT("eBSP_FLASH_WRITE lock fail", eHAL_EC == HAL_OK);

  if(eHAL_EC == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_FLASH_GET_START_ADDR(uint32_t * pStartAddr)
{
  ERROR_CODE eEC = ER_FAIL;

  if(pStartAddr != NULL)
  {
    *pStartAddr = FLASH_USER_START_ADDR;
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_FLASH_ERASE(void)
{
  ERROR_CODE eEC = ER_FAIL;
  uint32_t fault_sec = 0;
  HAL_StatusTypeDef eHAL_EC = HAL_ERROR;

  FLASH_EraseInitTypeDef er
  = {
      .TypeErase = TYPEERASE_SECTORS,
      .Sector = FLASH_SECTOR_11,
      .NbSectors = 1,
      .VoltageRange = VOLTAGE_RANGE_3
  };

  HAL_FLASH_Unlock();
  eHAL_EC = HAL_FLASHEx_Erase(&er, &fault_sec);
  vDEBUG_ASSERT("HAL_FLASHEx_Erase fail", eHAL_EC == HAL_OK);
  HAL_FLASH_Lock();

  if(eHAL_EC == HAL_OK)
  {
    eEC = ER_OK;
  }

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Inc_ms_count(void)
{
  ERROR_CODE eEC = ER_OK;



  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name:
* description:
* param description: type - value: value description (in order from left to right)
*                    bool - true: do action when set to true
* return value description: type - value: value description
******************************************************************************/
ERROR_CODE eBSP_Get_Current_ms_count(uint32_t * uiSystem_total_ms_count)
{
  ERROR_CODE eEC = ER_OK;

  *uiSystem_total_ms_count = HAL_GetTick();

  return eEC;
}

/******************************************************************************
* todo: NAME, DESCRIPTION, PARAM, RETURN
* name: eBSP_Board_Init
* description:
* param description: void
* return value description: ERROR_CODE - ER_OK: board init good
*                                        ER_FAIL: board init fail
******************************************************************************/
ERROR_CODE eBSP_Board_Init(void)
{
  ERROR_CODE eEC = ER_OK;

  HAL_Init();

  eEC = eBSP_SystemClock_Config();

  SystemCoreClock = HAL_RCC_GetHCLKFreq();

  SysTick_Config (SystemCoreClock / 1000);

  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __USART2_CLK_ENABLE();
//  __I2C1_CLK_ENABLE();

//  __USB_OTG_HS_CLK_ENABLE();

//  eEC = eBSP_Camera_Intf_Init();

  if(eEC == ER_OK)
  {
    eEC = eBSP_Wifi_Intf_Init();
  }

  if(eEC == ER_OK)
  {
    eEC = eBSP_Usb_Intf_Init();
  }

  return eEC;
}

#endif //__FILE_NAME_C__
